title: Testing
id: 4a3b86b9-ca91-4664-9b91-669d560b5ad6
status: experimental
description: testing
references: []
author: Ryan Wilson
date: '2025-09-04'
tags: []
logsource:
  product: windows
  service: security
  category: account_change
detection:
  sel_EventID:
    EventID:
    - '4786'
    - '4756'
  condition: sel_EventID
fields:
- timestamp
- TargetUser
- EventID
falsepositives:
- admin activities
- red team activity
level: low
